jeorg-jee-apps/jeorg-jee-apps-triad-2/jeorg-jee-app-2-2-wildfly/line1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:bt="http://soap.bands.girl.jee.jtd.jesperancinha.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <bt:sayYoullBeThere>
            <arg0>Ah, say you'll be there</arg0>
        </bt:sayYoullBeThere>
    </soapenv:Body>
</soapenv:Envelope>
